{
  "updated": "2025-12-29T13:51:30.256760",
  "episodes": [
    {
      "id": 18296133,
      "title": "2026 Ham Radio Predictions: New Rigs, Community & What's Next",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/18296133-2026-ham-radio-predictions-new-rigs-community-what-s-next.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>What does 2026 have in store for ham radio? A year into the podcast, James (K8JKU), Jim (N8JRD), and Rory (W8KNX) turn up the dial with a forward look at the hobby's near future — grounded in real gear, real operating, and real community.<br><br>We start in the shack with winter POTA prep, a feather-light 33-foot mast, a fiber-fueled network overhaul, and a pair of pristine rotary phones begging for a ham project. Then we get into the predictions.<br><br>On the gear side, we share our predictions for what hardware might be on the horizon — what we'd love to see from the major manufacturers and where we think the industry is heading.<br><br>But hardware isn't the whole story. POTA and SOTA remain the heartbeat of growth because they lower the barrier to entry and make radio feel alive. We share why portable operating will keep rising even as solar conditions tighten.<br><br>At home, we're betting on a repeater revival — AllStar links, creative nets like SSTV nights, and \"leave no call unanswered\" as the culture shift that keeps VHF/UHF useful and welcoming. College clubs are buzzing again, and the formula scales: be kind, run practical events, and meet people where they are — on-air, at meetups, or on Discord.<br><br>AI comes up, minus the hype. Think helpful, not magical: audio-assisted logging, smarter noise control, and developer tooling that speeds up ham software. It's another tool, like a good tuner — valuable when it saves time and stays out of the way.<br><br>We wrap with personal goals — Extra class ambitions and a fresh pull toward CW — and a reminder that every license class is valid. The hobby thrives when we celebrate each step and keep the airwaves friendly.<br><br>Connect with us:<br>🌐 Website: https://www.everydayham.com<br>📷 Instagram: https://www.instagram.com/everydayhampodcast/<br>💬 Discord: Join our community at everydayham.com<br><br>What rig are you hoping to see next? How will you help revive your local repeater? Drop your predictions in our Discord or in the comments!<br><br>Don't miss a single episode! Follow the Everyday Ham Podcast on your favorite podcast platform (Apple Podcasts, Spotify, Overcast, and more) and be sure to subscribe to our YouTube channel.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio predictions, amateur radio 2026, ham radio podcast, everyday ham, ham radio community, repeater revival, POTA, SOTA, Yaesu radio, ICOM, Kenwood, Elecraft, AllStar, SDR ham radio, AI ham radio, winter POTA, K8JKU",
      "published_at": "2025-12-04T12:00:00.000-05:00",
      "duration": 3053,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-18296133",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 12,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 613
    },
    {
      "id": 18131359,
      "title": "Can You Put Up An Antenna? The HOA Bill Fight & IC-7300 Mark II",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/18131359-can-you-put-up-an-antenna-the-hoa-bill-fight-ic-7300-mark-ii.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>A thousand subscribers may be a milestone, but the real win is what it represents: a growing community of hams trading ideas, trying new modes, and pushing for the right to put real antennas on real roofs. We open with momentum—POTA activations, contest firsts, and new video drops—then move straight into the issue shaping the future of the hobby: ARRL’s grassroots effort to pass the Amateur Radio Emergency Preparedness Act (HR 1094/S.459). If HOAs block antennas where most new homes are built, fewer operators will get on the air. We explain the stakes, the opposition from CAI, and the surprisingly easy way to send a letter that reaches your representatives in minutes.<br><br>We also get practical about life in the shack and on the road. Running 500 to 1,000 watts through contest weekend revealed where filters shine and where they need tuning, and winter prep is now or never—check matches, weatherproof connectors, and tighten your grounding. On the mobile side, an EV install in a Mach‑E delivered clean VHF/UHF performance with smart power routing and a 3D‑printed head mount, plus notes on AM noise under acceleration. If you’ve avoided EVs for RF reasons, this is a reality check rooted in measurements, not myths.<br><br>Gear watchers get plenty to chew on. The Icom IC‑7300 Mark II looks set to land around $1,499, squaring up against the Yaesu FTdx10 with modernized I/O and familiar ease of use. But the U.S. government shutdown is delaying FCC certifications across categories, which could push new radio launches past the holidays. Meanwhile, used IC‑7300 prices are compelling, making it a standout first HF rig. We wrap with FlexRadio’s SmartSDR 4.0—meaningful noise‑reduction improvements, a flexible subscription model, and a few early‑release quirks to monitor.<br><br>If you care about the bands staying lively and accessible, this conversation matters. Tune in, tell us if you’re backing the ARRL letter, weigh in on 7300 Mark II vs FTdx10, and share your winter station game plan. Subscribe, leave a review on Apple Podcasts or Spotify, and pass this along to a friend who’s antenna‑curious.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio, amateur radio, IC-7300 Mark II, Icom, ARRL, HOA, antenna rights, FCC, POTA, Flex Radio, contesting, everyday ham, ham radio podcast, CQ worldwide, Smart SDR, HR 1094, antenna freedom, ham radio news, FTdx10, Yaesu, emergency preparedness, Parks",
      "published_at": "2025-11-06T14:00:00.000-05:00",
      "duration": 2788,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-18131359",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 11,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 589
    },
    {
      "id": 17980624,
      "title": "How Frustration Built the Best Portable Logger: Sebastián KI2D & Ham2K PoLo",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17980624-how-frustration-built-the-best-portable-logger-sebastian-ki2d-ham2k-polo.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>A better logger doesn't just record contacts—it changes how you operate. We sit down with Sebastián KI2D, creator of Ham2K PoLo, to explore how mobile-first design, tiny UX details, and relentless iteration make portable operating smoother, faster, and less gear-heavy.&nbsp;</p><p>From his journey growing up in Venezuela to building startups in New York—and yes, proposing the Arepa and Olive emojis—Sebastián shares the mindset behind a tool that understands what activators actually do in the field.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio, amateur radio, POTA, parks on the air, Ham2K, Polo, portable logging, ham radio apps, Sebastian KI2D, KI2D, ham radio software, portable operations, QSO parties, contest logging, field operations, ham radio interview, software development, ham ",
      "published_at": "2025-10-09T16:00:00.000-04:00",
      "duration": 4664,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17980624",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 10,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 663
    },
    {
      "id": 17915090,
      "title": "Flex Radio's new 200 Dollar SmartSDR Subscription, is this the Future of Ham Radio Software?",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17915090-flex-radio-s-new-200-dollar-smartsdr-subscription-is-this-the-future-of-ham-radio-software.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>&nbsp;FlexRadio just announced SmartSDR Plus subscriptions starting at $199/year. Time for an impromptu Saturday morning coffee chat! Join James (K8JKU), Jim (N8JRD), and Rory (W8KNX) as we discuss what this means for ham radio and share our honest opinions.&nbsp;</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "FlexRadio, SmartSDR, SmartSDR Plus, ham radio, amateur radio, subscription, software subscription, SDR, coffee chat, everyday ham, ham radio discussion, flex radio subscription, ham radio podcast, K8JKU, N8JRD, W8KNX, radio software, ham radio opinions, f",
      "published_at": "2025-09-27T12:00:00.000-04:00",
      "duration": 1660,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17915090",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": null,
      "season_number": null,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 531
    },
    {
      "id": 17760784,
      "title": "From Parks to Peaks: How SOTA Differs from POTA",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17760784-from-parks-to-peaks-how-sota-differs-from-pota.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>Ever wondered what happens when you combine hiking, mountaineering, and ham radio? That's exactly what Summits on the Air (SOTA) is all about! In this episode, we step away from our usual Parks on the Air discussions to explore the thrilling world of mountaintop radio operations with two accomplished SOTA enthusiasts.<br><br>Meet Matt W7MDN, a pilot from Spokane who combines trail running and snowshoeing with radio, and Tim N7KOM, a mountaineer and YouTube creator from Bend who's known for his ultralight setups. Both have achieved the prestigious Mountain Goat award, representing 1,000 activation points earned by operating from mountain summits.<br><br>We unpack the fundamental differences between POTA and SOTA – while parks often allow drive-up operations with 100-watt rigs, SOTA requires reaching designated activation zones near peaks with equipment disconnected from vehicles. The equipment philosophy shifts dramatically too, with most SOTA operators using 5-10 watt radios like the MTR3 or Elecraft KX2, paired with lightweight wire antennas that can be quickly deployed.<br><br>The conversation dives into the meticulous planning required for SOTA activations, from researching access permissions to preparing for safety contingencies. Matt and Tim share their favorite activation stories, including Matt's Mountain Goat qualification during a January snowshoe expedition and Tim's sunrise celebration atop Mount McLaughlin complete with ceremonial goat horns.<br><br>Whether you're an experienced operator looking for a new challenge or simply curious about combining outdoor adventure with radio, this episode provides a comprehensive introduction to SOTA. You'll learn about the points system, equipment recommendations, online resources, and the thriving community that makes this radio sport so rewarding.<br><br>Ready to climb a mountain with your radio? This might just be the inspiration you need to earn those summit points and breathtaking views!</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio, amateur radio, SOTA, summits on the air, POTA, parks on the air, portable radio, mountain radio, hiking, mountaineering, ultralight radio, QRP, low power, CW, morse code, mountain goat award, summit activation, portable operations, outdoor radi",
      "published_at": "2025-09-04T17:00:00.000-04:00",
      "duration": 3170,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17760784",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 9,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 691
    },
    {
      "id": 17726132,
      "title": "New ICOM Radios Steal the Show - Tokyo Ham Fair Reactions",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17726132-new-icom-radios-steal-the-show-tokyo-ham-fair-reactions.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>The tides of amateur radio innovation ebb and flow as manufacturers take turns showcasing their latest technological marvels. While Yaesu dominated last year's Tokyo Ham Fair with the FTX1, this year unquestionably belonged to ICOM, who unveiled two significant new radios that have the ham community buzzing with anticipation.<br><br>ICOM's IC-7300 Mark II represents a thoughtful evolution of what has become perhaps the most popular HF radio of the past decade. Rather than reinventing the wheel, ICOM listened carefully to user feedback, maintaining the beloved form factor while modernizing crucial aspects. The enhanced receiver offers 12dB better noise performance, addressing one of the few criticisms of the original – its performance in crowded band conditions. Lower power consumption and 23% less heat generation make it more field-operation friendly, while connectivity gets a complete overhaul with HDMI output, USB-C with dual COM functionality, and SMA receiver antenna ports.<br><br>Equally exciting is the ID-5200 mobile radio, which finally brings ICOM's VHF/UHF mobile lineup into the modern era with a vibrant color touchscreen replacing the aging monochrome display of the ID-5100. Evidence suggests it may include native APRS functionality – a feature long requested by ICOM users – alongside Wi-Fi for internal D-STAR gateway functionality without requiring an external hotspot. Though still \"under glass\" as a concept, this hybrid-interface radio maintains ICOM's reputation for intuitive menu systems while adding modern connectivity options.<br><br>Perhaps most encouraging for the hobby was Uniden's return to the Ham Fair after a 40-year absence, potentially signaling renewed corporate interest in amateur radio markets. As manufacturers continue pushing innovation forward with substantial upgrades rather than incremental changes, there's never been a more exciting time to explore the evolving world of amateur radio technology. Which of these new offerings has captured your interest, and what features would you like to see in future ham radio developments?</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio, amateur radio, ICOM, 7300 Mark II, ID-5200, Tokyo Ham Fair, ham radio podcast, everyday ham, radio announcements, HF radio, mobile radio, D-STAR, APRS, Yaesu, FTX1, Uniden, ham radio news, radio technology, amateur radio equipment, ham radio co",
      "published_at": "2025-08-24T21:00:00.000-04:00",
      "duration": 1661,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17726132",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": null,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 538
    },
    {
      "id": 17625014,
      "title": "Are We Losing Ham Radio Spectrum? 70cm Band Under Threat",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17625014-are-we-losing-ham-radio-spectrum-70cm-band-under-threat.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p><b>Title:</b> Ham Radio Spectrum Defense &amp; The End of NOAA APT Era</p><p>Is amateur radio spectrum under siege? James (K8JKU), Jim (N8JRD), and Rory (W8KNX) tackle the controversial FCC experimental license granted to AST SpaceMobile that threatens our 70cm amateur band.</p><p>This episode covers the growing concern over spectrum encroachment, what the ARRL is doing to defend our frequencies, and why every ham needs to contact their representatives. We also discuss Jim's hands-on experience with the Flex 6400 ATU and bid farewell to the legendary NOAA-15 and NOAA-19 satellites.</p><p><b>Topics:</b> Spectrum defense, FCC policy, emergency communications, amateur radio advocacy, satellite operations, and the importance of congressional outreach for protecting our hobby.</p><p>Visit EverydayHam.com for show notes and join our Discord community!</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "Ham Radio, Amateur Radio, Spectrum Defense, FCC, 70cm, UHF, AST, Space Mobile, ARRL, Emergency Comms, POTA, NOAA, Satellites, Flex Radio, Hamcation, RTL-SDR",
      "published_at": "2025-08-07T17:00:00.000-04:00",
      "duration": 3433,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17625014",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 8,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 560
    },
    {
      "id": 17571459,
      "title": "Special Episode: 30 Years in Ham Radio with Ray Novak N9JA",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17571459-special-episode-30-years-in-ham-radio-with-ray-novak-n9ja.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>We have a very special treat for you! In this exclusive interview recorded during EAA AirVenture, we sit down with amateur radio industry veteran Ray Novak, N9JA. Surrounded by warbirds, fighter jets, and the constant buzz of the Oshkosh Air Show, Ray offers a fascinating glimpse into his world at the intersection of aviation and amateur radio.</p><p>Broadcasting from his impressive mobile setup – complete with a hex beam antenna towering 35 feet above his motorcoach – Ray shares incredible personal stories and experiences that bridge decades of radio evolution. From his journey as a Mississippi farm boy who avoided computer programming because it meant \"wearing a suit and tie\" to becoming a key figure in amateur radio manufacturing, Ray's path mirrors the transformation of radio technology itself.</p><p><b>Episode Highlights:</b></p><ul><li>Ray's transition from MFJ (nearly 300 hamfests!) to major radio manufacturer</li><li>Behind-the-scenes stories from 30+ years in the amateur radio industry</li><li>Technical insights on radio development and open protocols</li><li>IC-7760 development challenges during COVID disruptions</li><li>Remote operation capabilities that let you control your home station worldwide</li><li>Getting young people excited about amateur radio at special event station W9W</li><li>Tales from technical support (hint: upcoming episode!)</li></ul><p><b>Unique Audio Experience:</b> As young visitors stop by the Warbirds of America special event station W9W, you'll witness firsthand how these operations kindle technical curiosity in the next generation. Between thunderous F-35 flybys and impromptu visits from fellow aviation enthusiasts, this conversation captures the spirit of amateur radio at its best – technically sophisticated yet thoroughly human, preserving tradition while embracing innovation.</p><p><b>Hosted by:</b> James Mills K8JKU, Jim Davis N8JRD, and Rory Locke W8KNX</p><p>What's your journey in amateur radio? Have you experienced the thrill of operating from a special event station or explored remote operation? Visit everydayham.com for show notes and links, and follow us on Instagram @everydayhampodcast. Share your stories – we'd love to hear how radio has connected your world!</p><p><b>Note:</b> You'll hear authentic airshow sounds and may notice occasional audio delays due to the remote connection from Oshkosh. Nothing's perfect, but that authentic atmosphere adds to the experience!</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio, amateur radio, Ray Novak, N9JA, EAA AirVenture, Oshkosh, aviation, warbirds, special event station, W9W, ICOM America, MFJ, radio manufacturer, IC-7760, remote operation, technical support, ham radio history, Mississippi, electronics, hamfest, ",
      "published_at": "2025-07-28T12:00:00.000-04:00",
      "duration": 5032,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17571459",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": null,
      "season_number": null,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 502
    },
    {
      "id": 17441669,
      "title": "Field Day Disappointment? Why We Think ARRL Needs to Evolve (+ FTX1 Final Update)",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17441669-field-day-disappointment-why-we-think-arrl-needs-to-evolve-ftx1-final-update.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>What happens when the \"Super Bowl of Amateur Radio\" meets poor band conditions? The Everyday Ham team breaks down their 2025 ARRL Field Day experience with honest reflection about what worked, what didn't, and why it still matters.</p><p>Despite challenging propagation that made 20 meters nearly useless, our South Lyon Area Amateur Radio Club (SLAARC) field operation managed 680 QSOs with 16 operators including several first-timers making their debut HF contacts. The camaraderie and mentorship moments proved more memorable than any score could reflect.</p><p>Our equipment choices sparked fascinating discussion about the evolution of field operations. We deployed simple yet effective antennas including Aerial-51 off-center fed dipoles on SOTA-beam masts and a remarkable military surplus 40-meter vertical built from scrap aluminum by silent key Larry K8UT that outperformed expectations. All stations used FTDX10 radios - a choice we explain after detailing our final journey away from problematic FTX1 models and praising Ham Radio Outlet's exceptional customer service.</p><p>The most thought-provoking segment explores whether POTA is replacing traditional Field Day. With outdoor portable operation now happening year-round, we question how ARRL might evolve Field Day to maintain relevance, particularly addressing the controversial 1D station rules. An 82-year-old ham's perspective that \"POTA is the future of ham radio\" launches us into examining the balance between contesting, emergency practice, and social connection.</p><p>Join us for laughs about Jim's abandoned attempt to backpack a DX10 to Mackinac Island, heated debates about \"please copy\" Field Day etiquette, and news about our exciting guest for Episode 8 - someone from one of the \"big three\" manufacturers you won't want to miss!</p><p><b>Subscribe:</b> <a href=\"https://www.everydayham.com\">https://www.everydayham.com</a></p><p>If you enjoy the Everyday Ham Podcast, please leave a five-star review - it helps others find us and keeps this conversation growing.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "ham radio, amateur radio, field day, ARRL, POTA, parks on the air, HF radio, FTDX10, FTX1, Yaesu, band conditions, propagation, emergency communications, portable operations, antenna, South Lyon, Michigan, SLAARC, amateur radio club, contest, QSO, 20 mete",
      "published_at": "2025-07-03T12:00:00.000-04:00",
      "duration": 3954,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17441669",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 7,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 618
    },
    {
      "id": 17282578,
      "title": "FTX1 Reality Check: Our Honest Review + SteppIR Exit",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17282578-ftx1-reality-check-our-honest-review-steppir-exit.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>The long-awaited Yaesu FTX1 Optima has finally arrived in ham shacks across America, but does it live up to the hype? We've spent days testing Yaesu's latest flagship and share our unfiltered experiences that left us reaching for our trusty FT-891s instead. From PTT issues that drop mid-transmission to strange menu bugs and disappointing receiver performance compared to the FT-710 and FT-DX10, we dive deep into what went wrong and whether firmware updates can save this premium-priced radio.</p><p>In a surprising market development, we explore the news that SteppIR has announced their exit from the amateur radio consumer market by August 2025. Their CEO cites an aging ham population moving to stealth antennas as HOAs restrict traditional towers. Is this the beginning of a larger trend in ham radio manufacturing following MFJ's recent exit, or simply market evolution as the hobby changes?</p><p>Summer is here, and that means Field Day is just around the corner! Whether you're a newly licensed ham nervous about your first HF contact or an experienced operator looking to test emergency preparedness, we share why Field Day (June 28-29) offers something for everyone. From operating tips to overcoming microphone fright, discover why this annual event remains amateur radio's most beloved gathering.</p><p>The amateur radio landscape continues to shift, with new technologies promising innovation while established companies retreat from changing markets. Through it all, what matters most is finding the gear and activities that spark joy in your radio journey. What's working for you this summer?</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-06-05T12:00:00.000-04:00",
      "duration": 4057,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17282578",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 6,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 507
    },
    {
      "id": 17198150,
      "title": "Hamvention 2025 Breakdown: What We Saw, What We Loved",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17198150-hamvention-2025-breakdown-what-we-saw-what-we-loved.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<h1>The Dayton Hamvention 2025 delivered on every front as we explored Xenia's grounds with our South Lion Area Amateur Radio Club members in their distinctive yellow shirts. This year's highlights included the Kenwood TH-D750 triple-band mobile with its built-in D-STAR hotspot and accessibility features, Flex Radio's impressive Aurora series with integrated 500-watt amplifiers starting at $6,199, and our realization that premium ham equipment now commands significantly higher prices—sparking discussions about value, longevity, and manufacturer support.<br><br>Beyond the technology, Hamvention's true magic came through personal connections: chance encounters with podcast listeners, meeting Sebastian KI2D (developer of Ham2K Polo software), and our club's social events at Caesar Creek campground. Join us for more connections at the Michigan POTA meetup on June 7th at Fort Custer State Recreation Area, and share your experiences with TSA's new 100Wh lithium battery restrictions on our new Discord server at everydayham.com!</h1><p><br></p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-05-20T15:00:00.000-04:00",
      "duration": 3063,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17198150",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": null,
      "season_number": null,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 433
    },
    {
      "id": 17122535,
      "title": "Is the Yaesu FTX1 a True Game Changer? Plus Dayton Hamvention 2025",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/17122535-is-the-yaesu-ftx1-a-true-game-changer-plus-dayton-hamvention-2025.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>Is the Yaesu FTX-1F a True Game Changer? Plus Dayton Hamvention 2025</p><p>Yaesu has shaken the amateur radio world with the release of their new FTX-1F series, particularly the Optima model with its revolutionary modular design. We explore the groundbreaking features that have hams reaching for their wallets—from the detachable QRP head unit that can operate standalone, to the 100-watt amplifier attachment that makes this one of the most versatile radios ever produced.&nbsp;</p><p>Rory takes us through his Michigan QSO Party adventure in Oscoda County, where he activated a rare county from a cozy Airbnb near Luzerne. Despite challenging band conditions, he managed to work over 40 Michigan counties and came away with a respectable score. His experiences highlight the perfect use case for Yaesu's new offering—a radio that can transition seamlessly from powerful base station to lightweight field unit.&nbsp;</p><p>With Hamvention rapidly approaching, we share our strategies for making the most of ham radio's biggest event. From forum recommendations (don't miss the POTA sessions!) to flea market tactics and practical advice about staying comfortable in the heat, we offer insights that will help first-timers and veterans alike. We'll be camping at Caesar Creek in the D-E loops and would love to meet listeners who are attending.&nbsp;</p><p>The FTX-1F Optima's impressive feature set includes dual antenna ports, built-in antenna tuner with memory, and modern USB-C connectivity for both data and power delivery. While not perfect—no true dual receive for satellite operations and no separation cable option for mobile installation—the radio represents a significant leap forward in transceiver design that may influence the direction of amateur radio equipment for years to come.&nbsp;</p><p>Grab your comfortable shoes, sunscreen, and shopping list—we're heading to Hamvention! We'll be recording short segments throughout the event to capture the excitement and innovation that makes this gathering the highlight of the ham radio calendar. Whether you're chasing the latest gear or hunting vintage treasures in the flea market, we hope to see you there.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-05-08T09:00:00.000-04:00",
      "duration": 3739,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-17122535",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 5,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 409
    },
    {
      "id": 16912708,
      "title": "From Scanner to Transmitter: How Everyday Hobbies Lead to Ham Radio",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/16912708-from-scanner-to-transmitter-how-everyday-hobbies-lead-to-ham-radio.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>In this episode of <em>Everyday Ham</em>, we explore how everyday hobbies — from scanning police channels to using walkie-talkies with friends — can spark a lifelong interest in amateur radio. James (K8JKU), Jim (N8JRD), and Rory (W8KNX) share their personal journeys into the hobby, along with highlights (and regrets) from the recent Toledo Hamfest. We also talk storm preparedness, building your first antenna, and why welcoming new hams matters more than ever. Whether you're a seasoned operator or radio-curious, this one’s for you.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-04-03T20:00:00.000-04:00",
      "duration": 3787,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-16912708",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 4,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 492
    },
    {
      "id": 16745714,
      "title": "The Good, The Bad, and The Junk – Swap Meet Scores & DXpedition Drama",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/16745714-the-good-the-bad-and-the-junk-swap-meet-scores-dxpedition-drama.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>In this episode of <em>Everyday Ham</em>, James (K8JKU), Rory (W8KNX), and Jim (N8JRD) dive into the <b>highs and lows of ham swaps</b>, sharing their experiences from the <b>Livonia Amateur Radio Club Swap &amp; Shop</b>. They break down the best strategies for <b>scoring great deals, avoiding overpriced junk, and navigating the chaos of a busy swap meet</b>.</p><p>But that’s not all—this episode also tackles a <b>hot debate in the POTA and DX community</b>. A recent <b>Costa Rica DXpedition</b> sparked controversy when operators skipped formal park number exchanges, leaving some POTA chasers frustrated. Was this a case of bad operating, or are people missing the point of a DXpedition? The guys share their takes on <b>POTA etiquette, fast-paced activations, and why every ham should embrace the \"work them how they work you\" mindset</b>.</p><p>Plus, Jim takes his first steps into the world of <b>DMR radio</b>, Rory shares his <b>contesting victories</b>, and the crew discusses the <b>best upcoming swap meets and why every ham should attend at least one</b>.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-03-06T14:00:00.000-05:00",
      "duration": 3825,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-16745714",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 3,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 386
    },
    {
      "id": 16574585,
      "title": "Is Yaesu Changing the Game? Exploring the New Mobile Lineup",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/16574585-is-yaesu-changing-the-game-exploring-the-new-mobile-lineup.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>As Yaesu navigates a shift in its mobile radio lineup, we're here to dissect the implications of these changes. From the unexpected discontinuation of older models to the buzz surrounding the anticipated FTX-1F release, we examine what this means for the future of mobile communication. Dive into the amateur radio community's reactions and ponder Yaesu's strategic moves with us. We'll discuss the groundbreaking advancements in audio signal processing, especially their potential to enhance emergency communications, and consider how these innovations could transform the market.</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-02-06T11:00:00.000-05:00",
      "duration": 3516,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-16574585",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 2,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 405
    },
    {
      "id": 16408083,
      "title": "Hams On the Air: Episode 1 – Every Ham Has a Story",
      "audio_url": "https://www.buzzsprout.com/2438895/episodes/16408083-hams-on-the-air-episode-1-every-ham-has-a-story.mp3",
      "artwork_url": "https://storage.buzzsprout.com/aalrudf4cd8je5dfhf4m1v0tbgdw",
      "description": "<p>Welcome to the inaugural episode of <em>Everyday Ham</em>! Join James, Rory, and Jim as they introduce themselves, share their ham radio journeys, and discuss the diversity of this amazing hobby. From family legacies to rediscovering ham radio after years away, they explore what drew them to the airwaves. They also dive into their goals for 2025, like tackling CW, and preparing for the ultimate ham pilgrimage—Dayton Hamvention. This casual, conversational episode is a perfect starting point for new and seasoned hams alike.&nbsp;</p>",
      "summary": null,
      "artist": "Rory Locke (W8KNX), Jim Davis (N8JRD), & James Mills (K8JKU)",
      "tags": "",
      "published_at": "2025-01-09T11:00:00.000-05:00",
      "duration": 3518,
      "hq": false,
      "magic_mastering": true,
      "guid": "Buzzsprout-16408083",
      "inactive_at": null,
      "custom_url": "",
      "episode_number": 1,
      "season_number": 1,
      "episode_type": "full",
      "explicit": false,
      "private": false,
      "total_plays": 363
    }
  ]
}